const path = require ('path')

module.exports = {

////////////////////////////////////////////////////////////////////////////////

get_xsd_path_of_f_a_t_a_l_i_n_f:

    function () {

		return path.join (__dirname, '..', 'Static/zags-fatalinf-ru-root.xsd')

    },

////////////////////////////////////////////////////////////////////////////////

get_request_of_f_a_t_a_l_i_n_f:

    function () {

		return this.rq.data
    	
    },

////////////////////////////////////////////////////////////////////////////////

get_response_of_f_a_t_a_l_i_n_f:

    function () {
/*    
    	const {rq: {data}} = this
*/
    	return {
  "FATALINFResponse": {
    "ИдЗапрос": "0bde2079-eded-11ea-952d-00155d01aa22",
    "ДатаСвед": "2020-06-02",
    "КолДок": "1",
    "ТипАГСЗапрос": "07",
//    "schemaLocation": "urn://x-artefacts-zags-fatalinf/root/112-52/4.0.1 zags-fatalinf-ru-root.xsd",
    "СведОтветАГС": {
      "ИдДок": "0bde2079-eded-11ea-952d-00155d01aa21",
      "РезОбраб": "1",
      "СведРегСмерт": {
        "РазделЕГР": "1",
        "НомерЗаписЕГР": "170209060000401234123",
        "НомАГССвид": "1235",
        "НомерВерс": "0",
        "ДатаВерс": "2020-05-02",
        "КодСостСтат": "0101",
        "ДатаЗаписДок": {
          "ПрДень": "1",
          "ПрМесяц": "1",
          "Год": "2010"
        },
        "ОрганЗАГС": {
          "НаимЗАГС": "Отдел Государственной службы записи актов гражданского состояния Республики Ингушетия Джейрахского района",
          "КодЗАГС": "R0600004"
        },
        "СвидетСмерт": {
          "ТипСвидет": "1",
          "СерияСвидет": "XII-АА",
          "НомерСвидет": "213487",
          "ДатаВыдСвидет": "2020-05-15"
        },
        "ПрдСведРег": {
          "Пол": "2",
          "ГраждТекст": "Россия",
          "ФИОУмер": {
            "Фамилия": "Иванова",
            "Имя": "Мария",
            "Отчество": "Петровна"
          },
          "МестоРожден": {
            "ПризнМесто": "1",
            "МестоТекст": "Российская Федерация, Тюменская область, г. Тюмень"
          },
          "ДатаРождКаленд": "1995-01-01",
          "ПрУдЛичнФЛ": "1",
          "МЖПосл": {
            "АдрМЖРФ": {
              "АдрРФФИАС": {
                "АдрТекст": "Российская Федерация, Тюменская область, г. Тюмень, ул. Николая Федорова, д.17, кв.309",
                "ИдНом": "6ce4f31e-2f77-427a-8a50-5c2175ba0cc0",
                "ОКТМО": "71701000",
                "Индекс": "000000",
                "КодРегион": "72",
                "НаимРегион": "Тюменская область",
                "Город": "Тюмень",
                "Улица": "ул Николая Федорова",
                "Дом": "17",
                "Кварт": "309"
              }
            }
          },
          "ДатаСмертКаленд": "2020-05-20",
          "ВремяСмерт": "11:45:00",
          "МестоСмерт": {
            "ПризнМесто": "1",
            "МестоТекст": "Российская Федерация, Тюменская область, г. Тюмень"
          },
          "ПрСведПричСмерт": "1"
        }
      }
    }
  }
}

},

}